vernonet/ESP32_PRJ/esp32_wifi_microphone_a1s_aac/src/main.cpp
#if defined(ESP8266)
  #include <ESP8266WiFi.h>  //ESP8266 Core WiFi Library 
  #include <DNSServer.h>
  #include <ESP8266WebServer.h>
#else      //for esp32    
  #include <esp_wifi.h>
  #include <WiFi.h>
  #include <WiFiClient.h>
#endif
#include <esp_arduino_version.h>
#define USE_AVAILABLE_PAGES     true
#include <ESP_WiFiManager.h>
#include "I2SMEMSSampler.h"
#include <ESPmDNS.h>
#include <NTPClient.h>
#include <driver/i2s.h>
#include "main.h"
#include <Update.h>
#include "soc/timer_group_struct.h"
#include "soc/timer_group_reg.h"
#include <ArduinoJson.h> 

#define USE_LITTLEFS    true
#include "FS.h"
#include <LittleFS.h>
FS* filesystem =      &LittleFS;
#define FileFS        LittleFS
#define FS_Name       "LittleFS"
const char* CONFIG_FILE = "/ConfigSW.json";

#include "AudioTools.h"
#include "AudioCodecs/CodecAACFDK.h"
#include "AudioTools/AudioStreams.h"


extern "C" {
uint8_t temprature_sens_read();
}

// I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S I2S
// SPH0645, INMP441 MEMS MICROPHONE
//insert in vlc  "http://wifi-mic.local:8080/rec.aac" or "http://<user>:<pass>@wifi-mic.local:8080/rec.aac" or "http://ip:8080/rec.aac"   ip - ip address of mic
//for ota update  http://wifi-mic.local:8080/upd_frm 
//for info        http://wifi-mic.local:8080/info


#define SAMPLE_BUFFER_SIZE         512    //Length of one buffer, in 32-bit words.  //512 //300  
#define BUF_CNT                    8      // Number of buffers in the I2S circular buffer   
#define SAMPLE_RATE                22050  //22050 //33000  //16000
#define BITS_PER_SAMPLE            (16)   // only 16   
#define I2S_MIC_CHANNEL            I2S_CHANNEL_FMT_ONLY_LEFT // most microphones will probably default to left channel but you may need to tie the L/R pin low
#define I2S_MIC_SERIAL_CLOCK       GPIO_NUM_18
#define I2S_MIC_LEFT_RIGHT_CLOCK   GPIO_NUM_5
#define I2S_MIC_SERIAL_DATA        GPIO_NUM_23
#define SERVER_PORT                "8080"
#define BAUDRATE                  (BAUDRATE_)
#define SIGNAL_GAIN                (0)// 0 - max gain, 2 - no gain
#define REC_TIME                   (6000) //sec
#define NUM_CPY                    ((SAMPLE_RATE * BITS_PER_SAMPLE / 8 * REC_TIME)/SAMPLE_BUFFER_SIZE)//
#define USER_OTA                   "admin"
#define PASS_OTA                   "admin"
#define PASS_CONF_PORTAL           "testtest"
#define LOG_SIZE                   (0x10000)


#define WIFI_CONNECT_TIMEOUT      30000L
#define WHILE_LOOP_DELAY          200L
#define WHILE_LOOP_STEPS          (WIFI_CONNECT_TIMEOUT / ( 3 * WHILE_LOOP_DELAY ))

// Use USE_DHCP_IP == true for dynamic DHCP IP, false to use static IP which you have to change accordingly to your network
#if (defined(USE_STATIC_IP_CONFIG_IN_CP) && !USE_STATIC_IP_CONFIG_IN_CP)
  // Force DHCP to be true
  #if defined(USE_DHCP_IP)
    #undef USE_DHCP_IP
  #endif
  #define USE_DHCP_IP     true
#else
  // You can select DHCP or Static IP here
  #define USE_DHCP_IP     true
#endif


#define reverse_bytes(value)        ((value & 0x000000FFU) << 24 | (value & 0x0000FF00U) << 8 |(value & 0x00FF0000U) >> 8 | (value & 0xFF000000U) >> 24)
#define reverse_halfword(value)     ((value & 0x00FFU) << 24 |  (value & 0xFF000000U) >> 24)
#define reverse_sample16(value)     (((value >> 8)&0xFF) | ((value << 8)&0xFF00))

#define param_info(str, nme, value)   str +=F("<tr><td>");\
                                      str +=F(nme);\
                                      str +=F("</td><td>");\
                                      str += value;\
                                      str += F("</td></tr>");

#define LED_ON                     LOW
#define LED_OFF                    HIGH
#define PIN_LED                    GPIO_NUM_22         // 
#ifdef ARDUINO_ESP32_RELEASE_1_0_6 
  #define ESP_getChipId()   (ESP.getChipId())
#endif 

const i2s_port_t I2S_PORT = I2S_NUM_0;
uint8_t signal_gain = SIGNAL_GAIN;
volatile uint32_t wait_reset = 0;
uint32_t temp_buf_f[44/4]; //for header
String ssid = "wifi_mic_ap";
const char* password = PASS_CONF_PORTAL;     //password for config portal
// SSID and PW for your Router
String Router_SSID;
String Router_Pass;
const int TRIGGER_PIN3 = GPIO_NUM_13;      // short  contact to ground to enter config portal
volatile bool con_flag = false, start_rec = false, starting = true;
volatile unsigned int tme = 0;
uint32_t send_count;
WiFi_STA_IPConfig  WM_STA_IPconfig_;
const char compile_date[] = __DATE__ " " __TIME__;
bool authenticate=false;
char temp_[6];
char date_[11];
String log_page;
uint32_t free_mem8 = 0, free_mem32 = 0;

WebServer server;
WiFiClient client_;
// Define NTP Client to get time
const long utcOffsetInSeconds = 2 * 60 * 60; //+2;
WiFiUDP ntpUDP;
NTPClient timeClient(ntpUDP, "pool.ntp.org", utcOffsetInSeconds);
bool mtx = false;
const int SAMPLE_SIZE = SAMPLE_BUFFER_SIZE;
int16_t *samples;
uint8_t tmp_buf[1024];
TaskHandle_t SendToClientTaskHandle;
extern UINT  alloc_mem;
char m_login[12], m_pass[12], m_port[8];

void launchWeb(int webtype);
void i2sMemsToClientTask(void *param);
void i2sMemsToUartTask(void *param);
void SendToClientTask(void *param);
void configWiFi(WiFi_STA_IPConfig in_WM_STA_IPconfig);
void handleNotFound(void);
void handle_rec_aac(void); 
void handle_update(void);
void handle_upload(void);
void handle_upd_frm(void);
void handle_log(void);
void handle_info(void);
void logMemory();
static void fill_mem_seed(int seed, void *mem, int len, int block_size);
static bool check_mem_seed(int seed, void *mem, int len, int block_size);
bool writeConfigFile(void);
bool readConfigFile(void);
bool mount_fs(void);

I2SSampler *i2sSampler = NULL;
i2s_config_t i2s_config = {
  .mode = i2s_mode_t(I2S_MODE_MASTER | I2S_MODE_RX), // Receive, not transfer
  .sample_rate = SAMPLE_RATE,
  .bits_per_sample = I2S_BITS_PER_SAMPLE_32BIT, // could only get it to work with 32bits
  .channel_format = I2S_MIC_CHANNEL, // although the SEL config should be left, it seems to transmit on right
#ifdef ARDUINO_ESP32_RELEASE_1_0_6  
  .communication_format = i2s_comm_format_t(I2S_COMM_FORMAT_I2S | I2S_COMM_FORMAT_I2S_MSB),
#else  // 2.00.....
  .communication_format = i2s_comm_format_t(I2S_COMM_FORMAT_STAND_I2S),
#endif
  .intr_alloc_flags = (ESP_INTR_FLAG_LEVEL1 | ESP_INTR_FLAG_SHARED),        // Interrupt level 1
  .dma_buf_count = BUF_CNT,                        // number of buffers
  .dma_buf_len = SAMPLE_BUFFER_SIZE,               // samples per buffer
  .use_apll = true,
  .tx_desc_auto_clear = true
};
// The pin config as per the setup
i2s_pin_config_t i2s_mic_pins = {
  .bck_io_num = I2S_MIC_SERIAL_CLOCK,
  .ws_io_num = I2S_MIC_LEFT_RIGHT_CLOCK,
  .data_out_num = I2S_PIN_NO_CHANGE,
  .data_in_num = I2S_MIC_SERIAL_DATA
};

// using namespace aac_fdk; 
// AACEncoderFDK aac(acc_enc_Callback);
// AudioInfo info;
using namespace audio_tools;
RingBufferStream aac_stream(SAMPLE_BUFFER_SIZE*8);
AACEncoderFDK aac(aac_stream);
AudioBaseInfo info;

