vernonet/ESP32_PRJ/esp32_wifi_microphone_a1s_aac/src/main.cpp
void setup(void) {

  log_page.reserve(LOG_SIZE);
#if (BITS_PER_SAMPLE != 16)
  #error "This BITS_PER_SAMPLE not suported!!!!"
#endif  

  pinMode(TRIGGER_PIN3, INPUT_PULLUP);   //to enter config portal
  pinMode(PIN_LED, OUTPUT);              //

  delay(500);
  Serial.begin(BAUDRATE);
  
  Serial.printf("Total heap: %d KBytes\n\r", ESP.getHeapSize()/1024);
  Serial.printf("Free heap: %d KBytes\n\r", ESP.getFreeHeap()/1024);
  Serial.printf("Total PSRAM: %d KBytes\n\r", ESP.getPsramSize()/1024);
  Serial.printf("Free PSRAM: %d KBytes\n\r", ESP.getFreePsram()/1024);

  byte* psdRamBuffer = (byte*)ps_malloc(0x10000*16*3);  //test 3Mbytes
  fill_mem_seed(0xaaaa, psdRamBuffer, sizeof psdRamBuffer, 0x1000);
  if (check_mem_seed(0xaaaa, psdRamBuffer, sizeof psdRamBuffer, 0x1000)) {
     Serial.println("PSRAM test - OK!\n\r");
  }
  else Serial.println("PSRAM test - ERROR!\n\r");
  free(psdRamBuffer);

  Serial.print("\nStarting...\n\rcompile date: ");
  Serial.println(compile_date);
  samples = (int16_t *)malloc((BITS_PER_SAMPLE/8) * SAMPLE_SIZE*2);
  if (!samples) Serial.println("Failed to allocate memory for samples");

  if (!mount_fs() || !readConfigFile())
  {
    Serial.println(F("Failed to read ConfigFile, using default values"));
    strcpy(m_login, USER_OTA);
    strcpy(m_pass, PASS_OTA);
    strcpy(m_port, SERVER_PORT);
  }
   
  unsigned long startedAt = millis();
  ESP_WiFiManager ESP_wifiManager("wifi-mic");
  ESP_wifiManager.setMinimumSignalQuality(-1);
  // Set static IP, Gateway, Subnetmask, DNS1 and DNS2. New in v1.0.5
  // ESP_wifiManager.setSTAStaticIPConfig(IPAddress(192,168,2,114), IPAddress(192,168,2,1), IPAddress(255,255,255,0), IPAddress(192,168,2,1), IPAddress(8,8,8,8));
  // Have to create a new function to store in EEPROM/SPIFFS for this purpose
  Router_SSID = ESP_wifiManager.WiFi_SSID();
  Router_Pass = ESP_wifiManager.WiFi_Pass();  
  //ESP_wifiManager.getSTAStaticIPConfig(WM_STA_IPconfig_);
  //Remove this line if you do not want to see WiFi password printed
  Serial.println("Stored: SSID = " + Router_SSID + ", Pass = " + Router_Pass);
  // SSID to uppercase
  ssid.toUpperCase();
  if (Router_SSID == "")
  {
    Serial.println("We haven't got any access point credentials, so get them now");
    digitalWrite(PIN_LED, LED_ON); // Turn led on as we are in configuration mode.

    //it starts an access point
    //and goes into a blocking loop awaiting configuration
    if (!ESP_wifiManager.startConfigPortal((const char *) ssid.c_str(), password))
      Serial.println("Not connected to WiFi but continuing anyway.");
    else {
      Serial.println("WiFi connected...:)");
    }
  }

  digitalWrite(PIN_LED, LED_OFF); // Turn led off as we are not in configuration mode.

  startedAt = millis();

  while ( (WiFi.status() != WL_CONNECTED) && (millis() - startedAt < WIFI_CONNECT_TIMEOUT ) )
  { 
    IPAddress ip_255(255,255,255,255);   
    WiFi.disconnect(); // probalbly not needed
    delay(1000);
    WiFi.mode(WIFI_STA);
    //WiFi.config(INADDR_NONE, INADDR_NONE, INADDR_NONE);
    //WiFi.hostname("wifi-mic");
    String hostname = "wifi-mic";
    WiFi.setHostname(hostname.c_str());
    //WiFi.persistent (false);
    // We start by connecting to a WiFi network

    Serial.print("Connecting to ");
    Serial.println(Router_SSID);

    WiFi.begin(Router_SSID.c_str(), Router_Pass.c_str());

    int i = 0;
    while ((!WiFi.status() || WiFi.status() >= WL_DISCONNECTED) && i++ < WHILE_LOOP_STEPS)
    {
      delay(WHILE_LOOP_DELAY);
    }

    if (WiFi.localIP() == ip_255 && WiFi.status() == WL_CONNECTED) {//v.2.00.. get always 255.255.255.255 as IP address from WiFi.localIP()
      WiFi.disconnect();
      delay(1000);
      WiFi.mode(WIFI_STA);
      WiFi.setHostname(hostname.c_str());
      //configWiFi(WM_STA_IPconfig_);
      WiFi.config(IPAddress(0, 0, 0, 0), IPAddress(192, 168, 1, 1), IPAddress(255, 255, 255, 0), IPAddress(192, 168, 1, 1));
      WiFi.begin(Router_SSID.c_str(), Router_Pass.c_str()); 
      i = 0;
       while ((!WiFi.status() || WiFi.status() >= WL_DISCONNECTED) && i++ < WHILE_LOOP_STEPS)
      {
        delay(WHILE_LOOP_DELAY);
      }
    }
  }

  Serial.print("After waiting ");
  Serial.print((millis() - startedAt) / 1000);
  Serial.print(" secs more in setup(), connection result is ");

  if (WiFi.status() == WL_CONNECTED)
  {
    Serial.print("connected. Local IP: ");
    Serial.println(WiFi.localIP());
    con_flag = true;
    timeClient.begin();
    // GMT +1 = 3600
    // GMT +8 = 28800
    // GMT -1 = -3600
    // GMT 0 = 0
    timeClient.setTimeOffset(3600 * 3); //for GMT+3
    timeClient.update();
    launchWeb(0);
    digitalWrite(PIN_LED, LED_ON);
    delay(500);
    digitalWrite(PIN_LED, LED_OFF);
  }
  else
    Serial.println(ESP_wifiManager.getStatus(WiFi.status()));
}

//loop  loop  loop  loop  loop  loop  loop  loop  loop  loop  loop  loop  loop  loop  loop  loop  loop  loop  loop
void loop(void) {
  int32_t value;
  char buff[9]; 

  if (con_flag) {
    server.handleClient();
    if (tme < 1) {
      timeClient.update();
      unsigned long epochTime = timeClient.getEpochTime();
       //Get a time structure
      struct tm *ptm = gmtime ((time_t *)&epochTime); 
      int monthDay = ptm->tm_mday;
      int currentMonth = ptm->tm_mon+1;
      int currentYear = ptm->tm_year+1900;
      //get internal temp of ESP32
      uint8_t temp_farenheit= temprature_sens_read();
      //convert farenheit to celcius
      double temp = ( temp_farenheit - 32 ) / 1.8;
      memset(temp_, 0x30, sizeof temp_);
      sprintf(temp_, "%.4lg",temp);
      sprintf(date_, "%02d/%02d/%04d", monthDay,currentMonth,currentYear);
      if (starting){
        char strr[30];
        sprintf(strr, "...starting %s %02d:%02d\n", date_, timeClient.getHours(), timeClient.getMinutes());
        log_page = String(strr); 
        starting = false;
        free_mem8  = heap_caps_get_free_size(MALLOC_CAP_8BIT);
        free_mem32 = heap_caps_get_free_size(MALLOC_CAP_32BIT);
      }
      //Print complete date:
      char str[18];
      sprintf(str, "%02d/%02d/%04d %02d:%02d  itemp°C:%.4lg\n\r", monthDay,currentMonth,currentYear,timeClient.getHours(),timeClient.getMinutes(),temp);
      Serial.printf("%s", str);    
      if (WiFi.status() != WL_CONNECTED) {
        Serial.println("NO WIFI, try to connect");
        WiFi.mode(WIFI_STA);
       // WiFi.hostname("wifi-mic");
        WiFi.setHostname("wifi-mic");
        //WiFi.persistent (true);
        //WiFi.setOutputPower(0);
        WiFi.begin(Router_SSID.c_str(), Router_Pass.c_str());
      }
    }
    tme++;
    if (tme > 100000) tme = 0;
  }

