vernonet/ESP32_PRJ/esp32_wifi_microphone_a1s_aac/src/main.cpp
  // is configuration portal requested?
  if (digitalRead(TRIGGER_PIN3) == LOW)
  {
    Serial.println("\nConfiguration portal requested.");
    digitalWrite(PIN_LED, LED_ON); // turn the LED on by making the voltage LOW to tell us we are in configuration mode.

    //Local intialization. Once its business is done, there is no need to keep it around
    ESP_WiFiManager ESP_wifiManager;


    //Check if there is stored WiFi router/password credentials.
    //If not found, device will remain in configuration mode until switched off via webserver.
    Serial.print("Opening configuration portal. ");
    Router_SSID = ESP_wifiManager.WiFi_SSID();
    if (Router_SSID != "")
    {
      ESP_wifiManager.setConfigPortalTimeout(60); //If no access point name has been previously entered disable timeout.
      Serial.println("Got stored Credentials. Timeout 60s");
    }
    else
      Serial.println("No stored Credentials. No timeout");
    
    
    ESP_WMParameter p_m_login("mic_login", "mic Login", USER_OTA, 12);  
    ESP_WMParameter p_m_pass("mic_pass", "mic password", PASS_OTA, 12);
    ESP_WMParameter p_m_port("mic_port", "server port", SERVER_PORT, 8);

    ESP_wifiManager.addParameter(&p_m_login);
    ESP_wifiManager.addParameter(&p_m_pass);
    ESP_wifiManager.addParameter(&p_m_port);

    //it starts an access point
    //and goes into a blocking loop awaiting configuration
    if (!ESP_wifiManager.startConfigPortal((const char *) ssid.c_str(), password))
    {
      Serial.println("Not connected to WiFi but continuing anyway.");
    }
    else
    {
      //if you get here you have connected to the WiFi
      Serial.println("connected...yeey :):):)");
    }

    strcpy(m_login, p_m_login.getValue());
    strcpy(m_pass, p_m_pass.getValue());
    strcpy(m_port, p_m_port.getValue());
    // Writing JSON config file to flash for next boot
    writeConfigFile();

    digitalWrite(PIN_LED, LED_OFF); // Turn led off as we are not in configuration mode.
  }
  else if (!(con_flag)) {
    wait_reset++;
    delay(100);
    if (wait_reset >= 1800) ESP.restart();
  }

}

void createWebServer(int webtype)
{
  if ( webtype == 1 ) {  //softAP
    //

  } else if (webtype == 0) {  //are configured

    if (MDNS.begin("wifi-mic")) {
      Serial.println("MDNS responder started");
    }
    else {
      Serial.println("Error setting up MDNS responder!");
    }
    MDNS.addService("http", "tcp", atoi(m_port));  //orig 80
    //MDNS.addService("osc", "udp", 4500);
    //MDNS.addService("telnet", "tcp", 23);// Telnet server RemoteDebug

  server.onNotFound(handleNotFound);
  /*return index page which is stored in serverIndex */
  server.on("/upd_frm", HTTP_GET, handle_upd_frm);//for update frm http://wifi-mic.local:8080/upd_frm     admin:admin
  //server.on("/serverIndex", handle_serverIndex);
  /*handling uploading firmware file */
  server.on("/update", HTTP_POST, handle_update, handle_upload);
  server.on("/info", HTTP_GET, handle_info);
  server.on("/rec.aac", HTTP_GET, handle_rec_aac);
  server.on("/log", HTTP_GET, handle_log);
  }
}


void launchWeb(int webtype) {
  Serial.println("");
  Serial.println("WiFi connected");
  Serial.print("Local IP: ");
  Serial.println(WiFi.localIP());
  Serial.print("SoftAP IP: ");
  Serial.println(WiFi.softAPIP());
  createWebServer(webtype);
  // Start the server
  server.begin(atoi(m_port));
  Serial.println("Server started");
}



void handleNotFound() {
  server.send(404, "text/plain", "404: Not found"); // Send HTTP status 404 (Not Found) when there's no handler for the URI in the request
}

void handle_rec_aac() {
  if (strlen(m_login) > 0) {
      authenticate = true;
     }
  if (authenticate && !server.authenticate(m_login, m_pass)) {
        return server.requestAuthentication();
     }

  client_ = server.client();
  if (client_) {
    info.channels = 1;
    info.sample_rate = SAMPLE_RATE;
    info.bits_per_sample = BITS_PER_SAMPLE;
    aac.begin(info);

    Serial.print("New client conected - IP ");
    Serial.print(client_.remoteIP());
    Serial.printf(" PORT %d\n\r", client_.remotePort());
    char strr[18];
    sprintf(strr, "%s %02d:%02d", date_, timeClient.getHours(), timeClient.getMinutes());
    if (log_page. length() >= (LOG_SIZE-100)) log_page = "";
    //if (log_page. length() == 0) log_page = F("<div class='text'><pre>");
    //if (log_page.endsWith("</pre></div>")) log_page.remove(log_page.length()-12, 12);
    if (!(log_page.startsWith("<div class='text'><pre>"))) log_page =  String("<div class='text'><pre>") + log_page;
    log_page.replace("</pre></div>", "");   //delete old "</pre></div>"
    log_page += String(strr) +  String(" client conected IP ") + client_.remoteIP().toString() +  String(" <---> ");
  }
  if (!start_rec)  {  //if first connections
    start_rec = true;
    i2sSampler = new I2SMEMSSampler(I2S_NUM_0, i2s_mic_pins, i2s_config, false);
    // start sampling from i2s device
    i2sSampler->start(); 
  }
   //if any other connections
   else i2s_start(I2S_PORT);

   xTaskCreatePinnedToCore(SendToClientTask, "SendToClient Task", 4096, NULL, 1, &SendToClientTaskHandle, 0);

   server.setContentLength(CONTENT_LENGTH_UNKNOWN);
   server.send(200, "audio/aac");
  
   free_mem8 =  heap_caps_get_free_size(MALLOC_CAP_8BIT);
   free_mem32 = heap_caps_get_free_size(MALLOC_CAP_32BIT);

   send_count = 0;
   int samples_read;
   uint32_t readed_bytes = 0;
   while (true)
   {
      samples_read = i2sSampler->read(samples, SAMPLE_SIZE*2, BITS_PER_SAMPLE);
      readed_bytes += samples_read * (BITS_PER_SAMPLE/8);
      //Serial.printf("readed_bytes = %d \n\r", readed_bytes);
      yield();
      if (samples_read) aac.write((uint8_t*)samples, samples_read * (BITS_PER_SAMPLE/8));   
      yield();
     if (!client_ || readed_bytes >= (SAMPLE_BUFFER_SIZE * NUM_CPY))
     {
       Serial.print("client disconected\n\r");
       char strr[18];
       sprintf(strr, "%02d:%02d", timeClient.getHours(), timeClient.getMinutes());
       log_page += String(strr) + String(" client disconected ") + String("\n");
       // ESP.restart();
       i2s_stop(I2S_PORT);
       digitalWrite(PIN_LED, LED_OFF);
       aac.end();
       vTaskDelete(SendToClientTaskHandle);
       //clear the counter of allocated memory for the aac encoder 
       alloc_mem = 0; 
       break;
     }
   }
}

