vernonet/ESP32_PRJ/esp32_wifi_microphone_a1s_aac/src/main.cpp
void handle_upd_frm()
{ 
    if (strlen(m_login) > 0) {
      authenticate = true;
    }
    if (authenticate && !server.authenticate(m_login, m_pass)) {
        return server.requestAuthentication();
      }
    server.sendHeader("Connection", "close");
    //server.send(200, "text/html", loginIndex);
    server.send(200, "text/html", serverIndex);
}

void handle_upload()
 {
    HTTPUpload& upload = server.upload();
    if (upload.status == UPLOAD_FILE_START) {
      Serial.printf("Update: %s\n", upload.filename.c_str());
      if (!Update.begin(UPDATE_SIZE_UNKNOWN)) { //start with max available size
        Update.printError(Serial);
      }
    } else if (upload.status == UPLOAD_FILE_WRITE) {
      /* flashing firmware to ESP*/
      if (Update.write(upload.buf, upload.currentSize) != upload.currentSize) {
        Update.printError(Serial);
      }
    } else if (upload.status == UPLOAD_FILE_END) {
      if (Update.end(true)) { //true to set the size to the current progress
        Serial.printf("Update Success: %u\nRebooting...\n", upload.totalSize);
      } else {
        Update.printError(Serial);
      }
    }
}

void handle_update()
{   
    if (strlen(m_login) > 0) {
      authenticate = true;
    }
    if (authenticate && !server.authenticate(m_login, m_pass)) {
        return server.requestAuthentication();
      }
    server.sendHeader("Connection", "close");
    server.send(200, "text/plain", (Update.hasError()) ? "UPDATE FAIL" : "UPDATE OK");
    ESP.restart();
 }

 void handle_info() 
{
    if (strlen(m_login) > 0) {
      authenticate = true;
     }
    if (authenticate && !server.authenticate(m_login, m_pass)) {
        return server.requestAuthentication();
     }
    server.sendHeader("Connection", "close");
    
    // http://wifi-mic.local:8080/info
    String page = F("<html><head><meta http-equiv='content-type' content='text/html; charset=utf-8'></head><body>\n");
    page += F(WM_HTTP_STYLE);
    page += F("</head><body><div class='container'><div style='text-align:left;display:inline-block;min-width:260px;'>");
    page += F("<h2>wifi-mic information</h2>");
    page += F("<fieldset>");
    page += F("<h3>Device Data</h3>");
    page += F("<table class=\"table\">");
    page += F("<thead><tr><th>Name</th><th>Value</th></tr></thead><tbody>");

    param_info(page, "ESP32 core version    ", String(ESP_ARDUINO_VERSION_MAJOR) + "." + String(ESP_ARDUINO_VERSION_MINOR) + "." + String(ESP_ARDUINO_VERSION_PATCH)); 
    param_info(page, "Compil. date of  FW ", String(compile_date));    
    param_info(page, "Flash Chip Size ", (ESP.getFlashChipSize()/1024) + String(" kbytes"));
    param_info(page, "Access Point IP ", (WiFi.softAPIP().toString()));   
    param_info(page, "Access Point MAC", WiFi.softAPmacAddress()); 
    param_info(page, "SSID", Router_SSID);   
    param_info(page, "Station IP", WiFi.localIP().toString());  
    param_info(page, "Station MAC", WiFi.macAddress());  
    param_info(page, "Core temp", String(temp_) + String(" °C"));  
    param_info(page, "CpuFreq", String(ESP.getCpuFreqMHz()) + String(" MHz"));  
    param_info(page, "Free mem8/32bit", String(free_mem8/1024) + "/" + String(free_mem32/1024) + String(" Kbytes"));  
   // param_info(page, "Free mem8/32bit", free_mem32/1024 + String(" Kbytes"));
   
    page += F("</tbody></table>");
    page += F("</fieldset>");
    page += F("<a href='/log'>View log("); 
    page += String(log_page.length());
    page += F(" bytes)</a>");
    page += FPSTR(WM_HTTP_END);
    
    server.send(200, "text/html", (const char *) page.c_str());
}

void handle_log() 
{
    if (strlen(m_login) > 0) {
      authenticate = true;
     }
    if (authenticate && !server.authenticate(m_login, m_pass)) {
        return server.requestAuthentication();
     }
    log_page += F("</pre></div>"); 
    server.sendHeader("Connection", "close");
    server.send(200, "text/html", (const char *)log_page.c_str());
}

void configWiFi(WiFi_STA_IPConfig in_WM_STA_IPconfig)
{
  #if USE_CONFIGURABLE_DNS  
    // Set static IP, Gateway, Subnetmask, DNS1 and DNS2. New in v1.0.5
    WiFi.config(in_WM_STA_IPconfig._sta_static_ip, in_WM_STA_IPconfig._sta_static_gw, in_WM_STA_IPconfig._sta_static_sn, in_WM_STA_IPconfig._sta_static_dns1, in_WM_STA_IPconfig._sta_static_dns2);  
  #else
    // Set static IP, Gateway, Subnetmask, Use auto DNS1 and DNS2.
    WiFi.config(in_WM_STA_IPconfig._sta_static_ip, in_WM_STA_IPconfig._sta_static_gw, in_WM_STA_IPconfig._sta_static_sn);
  #endif 
}


// Task to send encoded data to wifi clients
void SendToClientTask(void *param)
{
  uint16_t cnt;

  while (true)
  {
    //for watchdog timer
    // TIMERG0.wdt_wprotect=TIMG_WDT_WKEY_VALUE;
    // TIMERG0.wdt_feed=1;
    // TIMERG0.wdt_wprotect=0;
    cnt = aac_stream.available();
    if (cnt>SAMPLE_BUFFER_SIZE*4) {
    //Serial.printf("available %d bytes \n\r", cnt);  
    aac_stream.readBytes(tmp_buf, 1024);
    server.sendContent_P((char *)tmp_buf,  1024);
    digitalWrite(PIN_LED, !digitalRead(PIN_LED)); 
    }
    //vTaskDelay(10 / portTICK_PERIOD_MS);
    delay(10);
  }
}

void logMemory() {
  log_d("Used PSRAM: %d", ESP.getPsramSize() - ESP.getFreePsram());
}

//Fills the memory in 32-bit words for speed.
static void fill_mem_seed(int seed, void *mem, int len, int block_size)
{
    uint32_t *p = (uint32_t *)mem;
    unsigned int rseed = seed ^ 0xa5a5a5a5;
    for (int i = 0; i < len/block_size; i++) {
        rseed = i ^ rseed;
        for (int ii = 0; ii < block_size/4; ii++) {
          *p++ = rand_r(&rseed);
        }
    }
}

//Check the memory filled by fill_mem_seed. Returns true if the data matches the data
//that fill_mem_seed wrote (when given the same seed).
//Returns true if there's a match, false when the region differs from what should be there.
static bool check_mem_seed(int seed, void *mem, int len, int block_size)
{
    uint32_t *p = (uint32_t *)mem;
    unsigned int rseed = seed ^ 0xa5a5a5a5;
    for (int i = 0; i < len/block_size; i++) {
        rseed = i ^ rseed;
        for (int ii = 0; ii < block_size/4; ii++) {
          uint32_t ex = rand_r(&rseed);
          if (ex != *p) {
             Serial.printf("check_mem_seed: %x has 0x%08x expected 0x%08x\n", i*block_size+((char*)p-(char*)mem), *p, ex);
             return false;
          }
          p++;
        }
    }
    return true;
}

bool writeConfigFile()
{
  Serial.println("Saving config file");

