vernonet/ESP32_PRJ/esp32_wifi_microphone_a1s_aac/src/main.cpp
#if (ARDUINOJSON_VERSION_MAJOR >= 6)
  DynamicJsonDocument json(1024);
#else
  DynamicJsonBuffer jsonBuffer;
  JsonObject& json = jsonBuffer.createObject();
#endif

  // JSONify local configuration parameters
  json["mic_login"] = m_login;
  json["mic_pass"]  = m_pass;
  json["mic_port"]  = m_port;
 

  // Open file for writing
  File f = FileFS.open(CONFIG_FILE, "w");

  if (!f)
  {
    Serial.println("Failed to open config file for writing");
    return false;
  }

#if (ARDUINOJSON_VERSION_MAJOR >= 6)
  serializeJsonPretty(json, Serial);
  // Write data to file and close it
  serializeJson(json, f);
#else
  json.prettyPrintTo(Serial);
  // Write data to file and close it
  json.printTo(f);
#endif

  f.close();

  Serial.println("\nConfig file was successfully saved");
  return true;
}

bool readConfigFile(void)
{
  // this opens the config file in read-mode
  File f = FileFS.open(CONFIG_FILE, "r");

  if (!f)
  {
    Serial.println("Configuration file not found");
    return false;
  }
  else
  {
    // we could open the file
    size_t size = f.size();
    // Allocate a buffer to store contents of the file.
    std::unique_ptr<char[]> buf(new char[size + 1]);

    // Read and store file contents in buf
    f.readBytes(buf.get(), size);
    // Closing file
    f.close();
    // Using dynamic JSON buffer which is not the recommended memory model, but anyway
    // See https://github.com/bblanchon/ArduinoJson/wiki/Memory%20model

#if (ARDUINOJSON_VERSION_MAJOR >= 6)
    DynamicJsonDocument json(1024);
    auto deserializeError = deserializeJson(json, buf.get());
    if ( deserializeError )
    {
      Serial.println("JSON parseObject() failed");
      return false;
    }
    serializeJsonPretty(json, Serial);
#else
    DynamicJsonBuffer jsonBuffer;
    // Parse JSON string
    JsonObject& json = jsonBuffer.parseObject(buf.get());
    // Test if parsing succeeds.
    if (!json.success())
    {
      Serial.println("JSON parseObject() failed");
      return false;
    }
    json.printTo(Serial);
#endif

    // Parse all config file parameters, override
    // local config variables with parsed values
    if (json.containsKey("mic_login"))
    {
      strcpy(m_login, json["mic_login"]);
    }

    if (json.containsKey("mic_pass"))
    {
      strcpy(m_pass, json["mic_pass"]);
    }

    if (json.containsKey("mic_port"))
    {
      strcpy(m_port, json["mic_port"]);
    }
  }
  Serial.println("\nConfig file was successfully parsed");
  return true;
}


//return true - ok, false - error
bool mount_fs(void) {

  if (!FileFS.begin(true)) {


    Serial.println(F("LittleFS failed! Already tried formatting."));
  
    if (!FileFS.begin())
    {     
      // prevents debug info from the library to hide err message.
      delay(100);
      
      Serial.println(F("LittleFS failed!. Please use SPIFFS or EEPROM. Stay forever"));

      return false;
    }
    
  }
   else {
     Serial.println(F("LittleFS mount OK!"));
     return true;
   }
  return true;
}

